<template>
  <v-layout align-center>
    <v-item-group v-model="window" class="shrink mr-4" mandatory tag="v-flex">
      <v-item v-for="n in length" :key="n">
        <div slot-scope="{ active, toggle }">
          <v-btn :input-value="active" icon @click="toggle">
            <v-icon>fiber_manual_record</v-icon>
          </v-btn>
        </div>
      </v-item>
    </v-item-group>

    <v-flex>
      <v-window v-model="window" class="elevation-1" vertical>
        <v-window-item v-for="n in items" :key="n.Title">
          <v-card flat>
            <v-card-text>
              <v-layout align-center mb-3>
                <v-avatar color="warning" class="mr-3" />
                <strong class="title">{{ n.Title }}</strong>
                <v-spacer />
                <v-btn icon>
                  <v-icon>supervisor_account</v-icon>
                </v-btn>
              </v-layout>
              <h2 class="text-xs-center">{{ n.titleH1 }}</h2>
              <v-divider />
              <p>{{ n.Content }}</p>
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
              <br />
            </v-card-text>
          </v-card>
        </v-window-item>
      </v-window>
    </v-flex>
  </v-layout>
</template>
<script>
export default {
  name: 'WindowIndex',
  data: () => ({
    length: 10,
    window: 0,
    items: [
      {
        Title: '1-я ступень',
        titleH1: 'Условия',
        Content:
          'бесплатные прогнозы, то есть Условия со 2-й по 10-ю ступени не выполнены'
      },
      {
        Title: '2-я ступень',
        titleH1: 'Регистрация',
        Content:
          'зарегистрирован на сайте более месяца, банк увеличен за все время или за последнюю неделю на 20%, у каппера минимум 5 прогнозов в неделю, за последний месяц не менее 20 прогнозов. Стоимость подписки выбираете сами от 1000 до 1499 рублей за неделю. Стоимость одного прогноза составляет 10% от подписки за неделю.'
      },
      {
        Title: '3-я ступень',
        titleH1: 'Регистрация',
        Content:
          'зарегистрирован на сайте более месяца, банк увеличен за все время на 30% или находиться на 2-й ступени, и за последнюю неделю банк увеличен на 10%, у каппера минимум 5 прогнозов за неделю, за месяц не менее 20 прогнозов. Стоимость подписки выбираете сами от 1500 до 1999 рублей за неделю. Стоимость одного прогноза составляет 10% от подписки за неделю.'
      },
      {
        Title: '4-я ступень',
        titleH1: 'Регистрация',
        Content:
          'зарегистрирован на сайте более месяца, банк увеличен за все время на 40% или находиться на 3-й ступени, и за последнюю неделю банк увеличен на 10%, у каппера минимум 5 прогнозов за неделю, за месяц не менее 20 прогнозов. Стоимость подписки выбираете сами от 2000 до 2499 рублей за неделю. Стоимость одного прогноза составляет 10% от подписки за неделю.'
      },
      {
        Title: '5-я ступень',
        titleH1: 'Регистрация',
        Content:
          'зарегистрирован на сайте более месяца, банк увеличен за все время на 50% или находиться на 4-й ступени, и за последнюю неделю банк увеличен на 10%, у каппера минимум 5 прогнозов за неделю, за месяц не менее 20 прогнозов. Стоимость подписки выбираете сами от 2500 до 2999 рублей за неделю. Стоимость одного прогноза составляет 10% от подписки за неделю.'
      },
      {
        Title: '6-я ступень',
        titleH1: 'Регистрация',
        Content:
          'зарегистрирован на сайте более месяца, банк увеличен за все время на 60% или находиться на 5-й ступени, и за последнюю неделю банк увеличен на 10%, у каппера минимум 5 прогнозов за неделю, за месяц не менее 20 прогнозов. Стоимость подписки выбираете сами от 3000 до 3499 рублей за неделю. Стоимость одного прогноза составляет 10% от подписки за неделю.'
      },
      {
        Title: '7-я ступень',
        titleH1: 'Регистрация',
        Content:
          'зарегистрирован на сайте более месяца, банк увеличен за все время на 70% или находиться на 6-й ступени, и за последнюю неделю банк увеличен на 10%, у каппера минимум 5 прогнозов за неделю, за месяц не менее 20 прогнозов. Стоимость подписки выбираете сами от 3500 до 3999 рублей за неделю. Стоимость одного прогноза составляет 10% от подписки за неделю.'
      },
      {
        Title: '8-я ступень',
        titleH1: 'Регистрация',
        Content:
          'зарегистрирован на сайте более месяца, банк увеличен за все время на 80% или находиться на 7-й ступени, и за последнюю неделю банк увеличен на 10%, у каппера минимум 5 прогнозов за неделю, за месяц не менее 20 прогнозов. Стоимость подписки выбираете сами от 4000 до 4499 рублей за неделю. Стоимость одного прогноза составляет 10% от подписки за неделю.'
      },
      {
        Title: '9-я ступень',
        titleH1: 'Регистрация',
        Content:
          'зарегистрирован на сайте более месяца, банк увеличен за все время на 90% или находиться на 8-й ступени, и за последнюю неделю банк увеличен на 10%, у каппера минимум 5 прогнозов за неделю, за месяц не менее 20 прогнозов. Стоимость подписки выбираете сами от 4500 до 4999 рублей за неделю. Стоимость одного прогноза составляет 10% от подписки за неделю.'
      },
      {
        Title: '10-я ступень',
        titleH1: 'Регистрация',
        Content:
          'зарегистрирован на сайте более месяца, банк увеличен за все время на 100% и более или находиться на 9-й ступени, и за последнюю неделю банк увеличен на 10%, у кппера минимум 5 прогнозов за неделю, за месяц не менее 20 прогнозов. Стоимость подписки выбираете сами от 5000 до 5500 рублей за неделю. Стоимость одного прогноза составляет 10% от подписки за неделю.'
      }
    ]
  })
}
</script>

