<template>
  <v-container>
    <v-layout column justify-center align-center>
      <bread-crumbs :items="items"></bread-crumbs>
      <v-card>
        <v-card-title>
          <v-spacer></v-spacer>
          <h1 class="display-1">Правила сайта</h1>
          <v-spacer></v-spacer>
        </v-card-title>
        <v-card-text>
          <p>
            На данном сайте представлены прогнозы на все виды спорта и другие
            события, на которые можно осуществить ставку в букмекерской конторе.
            Сайт привязан к реальной букмекерской конторе, то есть все коэффициенты реальные.
          </p>
          <p>
            Прогнозы может публиковать любой желающий после регистрации на сайте.
            При регистрации на вашем счете появиться виртуальная валюта в размере 10000 (десять тысяч евро).
          </p>
          <p>На виртуальные деньги вы делаете прогнозы, а программа сайта в автоматическом режиме подсчитывает ваш результат и определяет ваше место в рейтинге всех зарегистрированных участников (капперов).</p>
          <p>Рейтинг всех участников определяется за понедельно, помесячно и за все время. В дальнейшем если у вас будет хорошая статистика прогнозов, то автоматически будет предложено перевести ваши прогнозы в платные (то есть вы сможете их продавать).</p>
          <h2 class="text-xs-center">Как это сделать: (ссылка как заработать на сайте)</h2>
          <v-timeline>
            <v-timeline-item
              v-model="itemTimeline"
              v-for="n in itemTimeline"
              :key="n"
              color="red lighten-2"
              large
            >
              <template v-slot:opposite>
                <span>{{ n.title }}</span>
              </template>
              <v-card class="elevation-2">
                <v-card-title class="headline">Как это сделать?</v-card-title>
                <v-card-text>{{ n.text }}</v-card-text>
              </v-card>
            </v-timeline-item>
          </v-timeline>
        </v-card-text>
      </v-card>
      <v-alert
        :value="true"
        type="warning"
      >Внимание! Все прогнозы рассчитываются после окончания матча примерно в течение часа. Если Ваш прогноз не рассчитался в течение трех часов после окончания события или не правильно рассчитался, напишите в техподдержку: (ссылка помощь по сайту)</v-alert>
    </v-layout>
  </v-container>
</template>
<script>
import BreadCrumbs from '~/components/Page/Header/BreadCrumbs'
export default {
  name: 'prog-noz',
  components: { BreadCrumbs },
  data () {
    return {
      items: [
        {
          text: 'Главная',
          disabled: false,
          href: '/'
        },
        {
          text: 'правила сайта',
          disabled: true,
          href: ''
        }
      ],
      itemTimeline: [
        {
          title: 'заметка №1',
          text:
            'Каждый новый месяц ваш банк обнуляется, то есть у вас на счете будет вновь 10000 условных евро, вне зависимости были ли вы в прошлом месяце в плюсе или минусе, а все прошлые результаты отразятся на вашем рейтинге.'
        },
        {
          title: 'заметка №2',
          text:
            'В сутки разрешено публиковать не более 20 прогнозов, максимальная ставка не более 500 виртуальных евро, минимальная ставка 50 виртуальных евро. Прогноз должен быть опубликован до начала события. На нашем сайте вы можете ознакомиться с рекомендованными стратегиями ставок: (ссылка стратегии ставок)'
        },
        {
          title: 'заметка №3',
          text:
            'Для тех, кто плохо разбирается в прогнозах на спорт, вам достаточно зарегистрироваться на сайте, следить за успешными участниками (каперами) и повторять ставки за ними уже в реальных букмекерских конторах. Рейтинг легальных БК: (ссылка рейтинг БК)'
        }
      ]
    }
  }
}
</script>

