<template>
  <v-container>
    <v-layout column justify-center align-center>
      <bread-crumbs :items="items"></bread-crumbs>
      <v-card>
        <v-card-title>
          <v-spacer></v-spacer>
          <h1 class="display-1">Стратегии ставок</h1>
          <v-spacer></v-spacer>
        </v-card-title>
        <v-card-text>
          <h2 class="text-xs-center">Стратегии ставок</h2>
          <h3>Стратегия флэт</h3>
          <p>Грамотное управление банком в ставках часто спасает беттера от риска разорения. Особенно это актуально для тех игроков, кто рассчитывает на долгосрочную перспективу. Многие беттеры на дистанции предпочитают применять стратегию флэт.</p>
          <p>Стратегия флэт в спортивном беттинге – одна из самых эффективных, и, главное, простых для понимания. Суть в том, что игрок независимо от величины банка, делает фиксированную ставку.</p>
          <p>Причем величина фиксированнго флета – это не сумма, а процент от всего банка. Чтобы лучше понять, что значит флет в ставках на спорт, в частности футбол, рассмотрим пример стратегии и ее виды.</p>
          <h2 class="text-xs-center">Ставки флэтом – понятие и пример</h2>
          <p>
            Стратегия флэт в ставках на спорт предполагает следующую последовательность действий:
            Беттер вносит на счет букмекерской конторы определенную сумму. Независимо от ее величины – это банкролл игрока, от которого высчитывается величина флета.
          </p>
          <p>Беттер принимает решение о том, какой процент от банка будет впредь выделяться на одну ставку. Это и будут ставки флетом. Специалисты рекомендуют, чтобы беттер определил границы для флета в пределах 1-3% от банка.</p>
          <p>
            Что бы ни случалось и какой бы привлекательной и «железной» не казалась ставка, игрок не использует более высокий процент от банка или флэт, чем определил в самом начале.
            При этом нужно учитывать, что самый простой вид стратегии флэт в ставках на спорт предполагает распределение не текущего банка (суммы с учетом всех выигрышей и проигрышей). А именно изначального игрового банка.
          </p>
          <h2 class="text-xs-center">Стратегия флэт в ставках – пример</h2>
          <p>
            У беттера есть банк 10000 евро.
            Он принимает решение о том, что будет ставить флэтом в 2%.
            Значит, банк разбивается на равное количество ставок флет по 2% от 10000 евро = 50 ставок по 200 евро.
          </p>
          <p>
            Игрок делает 50 ставок по 200 евро и оценивает прибыль от стратегии флетом.
            Стратегия фиксированного процента от банка большинством беттером признается наиболее безопасной. Но, к сожалению, эта система не всегда может гарантировать стабильный или значительный плюс. Ведь для ее реализации беттеру нужно иметь немалое терпение и выдержку.
          </p>
          <p>
            Виды флетов – для новичков и более опытных беттеров
            Что такое или что означает флэт в ставках на спорт, мы уже разобрались. Теперь рассмотрим, какие методы фиксированного процента применяются в беттинге:
          </p>
          <p>
            <strong>
              <em>
                <u>Академический</u>
              </em>
            </strong> – стратегия ставок флетом, при которой игрок использует 1%, 2% или 3% для одного матча. При этом величина суммы зависит от значимости спортивного события и того, насколько беттер уверен в заходе ставки.
          </p>
          <p>
            <strong>
              <em>
                <u>Статистический</u>
              </em>
            </strong> – предполагает фиксированный флэт в 1% на все спортивные события. Если у беттера хорошие способности к аналитике (он хорошо знает особенности футбольных команд, на которые ставит) или он пользуется услугами каппера с проходимостью прогнозов на уровне 70-80%, банк будет стабилен.
          </p>
          <p>
            <strong>
              <em>
                <u>Хаотичный</u>
              </em>
            </strong> – ставим флетом в 5%-10% от банка. Довольно рискованный вид тактики ставок. Коэффициенты желательно выбирать от 1,7. Данный вид лучше использовать при небольшом банке и на длинной дистанции, делая редкие, но верные ставки.
          </p>
          <p>
            <strong>
              <em>
                <u>Агрессивный</u>
              </em>
            </strong> – что значит такой флэт? Это вариант для настойчивых. Ставки делаются в размере 3%, и даже в случае проигрыша сумма ставки не уменьшается. При этом игрок должен быть готов к существенным убыткам в случае серии неудачных ставок.
          </p>
          <p>
            Некоторые считают, что стратегия флэт – самая правильная, так как минимизирует риски. Отчасти это так, но только не в случае ее хаотичного или агрессивного варианта.
            Что такое фиксированный флэт с порогами.
          </p>
          <p>Некоторые беттеры интересуются, как это ставим флетом с порогами? Флет с порогами – это вариант стратегии ставок, но с периодическим учетом всего банка. К примеру, первоначальный банкролл – 100 рублей. Беттер ставит цель – пока банк не возрастет до 125 руб., он ставит только по 2% ( 2 рубля). Как только банк вырастет до 125, он начинает ставить по 2,5% от всего банка, и так далее. Если же банк падает, соответственно, снижается и флет (1,5% или 1%).</p>
          <p>
            Как правильно ставить флэтом – нюансы стратегии
            Что это такое стратегия флет в ставках, какие бывают виды флета – все это полезно знать для грамотного управления банкроллом. Однако, если беттер не намерен оставить все свои деньги БК, он должен соблюдать простые правила:
            Не отступать от выбранной стратегии флет, не делать эмоциональных ставок.
            Определять размер флэта относительно первоначального банка, не учитывая средства, которые поступили от выигрышей (за исключением варианта флета с порогами).
            В случае значительного увеличения денег на счету – выведете их. Из них лучше сформировать новый банк, заначку на «черный день» или потратить на свои нужды. Всем удачных ставок.
          </p>
        </v-card-text>
      </v-card>
    </v-layout>
  </v-container>
</template>
<script>
import BreadCrumbs from '~/components/Page/Header/BreadCrumbs'
import WindowIndex from '~/components/WindowIndex'
export default {
  name: 'prog-noz',
  components: { BreadCrumbs, WindowIndex },
  data () {
    return {
      itemss: [
        {
          title: 'От -1% до -10%  на 1 ступень ниже'
        },

        {
          title: 'От -11% до -20%  на 2 ступени ниже'
        },
        {
          title: 'От -21% до -30%  на 3 ступени ниже'
        },
        {
          title: 'От -31% до -40% на 4 ступени ниже'
        },
        {
          title: 'От -41% до -50% на 5 ступеней ниже'
        },
        {
          title: 'От -51% до -60% на 6 ступеней ниже'
        },
        {
          title: 'От -61% до -70% на 7 ступеней ниже'
        },
        {
          title: 'От -71% до -80% на 8 ступеней ниже'
        },
        {
          title: 'От -81% и более на 9 ступеней ниже'
        }
      ],
      items: [
        {
          text: 'Главная',
          disabled: false,
          href: '/'
        },
        {
          text: 'стратегии ставок',
          disabled: true,
          href: ''
        }
      ],
      itemTimeline: [
        {
          title: 'заметка №1',
          text:
            'Каждый новый месяц ваш банк обнуляется, то есть у вас на счете будет вновь 10000 условных евро, вне зависимости были ли вы в прошлом месяце в плюсе или минусе, а все прошлые результаты отразятся на вашем рейтинге.'
        },
        {
          title: 'заметка №2',
          text:
            'В сутки разрешено публиковать не более 20 прогнозов, максимальная ставка не более 500 виртуальных евро, минимальная ставка 50 виртуальных евро. Прогноз должен быть опубликован до начала события. На нашем сайте вы можете ознакомиться с рекомендованными стратегиями ставок: (ссылка стратегии ставок)'
        },
        {
          title: 'заметка №3',
          text:
            'Для тех, кто плохо разбирается в прогнозах на спорт, вам достаточно зарегистрироваться на сайте, следить за успешными участниками (каперами) и повторять ставки за ними уже в реальных букмекерских конторах. Рейтинг легальных БК: (ссылка рейтинг БК)'
        }
      ]
    }
  }
}
</script>

